1. Write a SQL query to get the second highest salary from the Employee table. <br>

+----+--------+<br>
| Id | Salary |<br>
+----+--------+<br>
| 1  | 100    |<br>
| 2  | 200    |<br>
| 3  | 300    |<br>
+----+--------+<br>
For example, given the above Employee table, the query should return 200 as the second highest salary. If there is no second highest salary, then the query should return null.<br><br>

+---------------------+<br>
| SecondHighestSalary |<br>
+---------------------+<br>
| 200                 |<br>
+---------------------+<br>

In [ ]:
SELECT
    IFNULL(
      (SELECT distinct(Salary)
       FROM Employee
       ORDER BY Salary DESC
        LIMIT 1 OFFSET 1),
    NULL) AS SecondHighestSalary

The Employee table holds all employees including their managers. Every employee has an Id, and there is also a column for the manager Id.<br><br>

+----+-------+--------+-----------+ <br>
| Id | Name  | Salary | ManagerId |<br>
++-------+--------+-----------+<br>
| 1  | Joe   | 70000  | 3         |<br>
| 2  | Henry | 80000  | 4         |<br>
| 3  | Sam   | 60000  | NULL      |<br>
| 4  | Max   | 90000  | NULL      |<br>
+----+-------+--------+-----------+<br>
Given the Employee table, write a SQL query that finds out employees who earn more than their managers. For the above table, Joe is the only employee who earns more than his manager.<br><br><br>

+----------+<br>
| Employee |<br>
+----------+<br>
| Joe      |<br>
+----------+<br>

In [ ]:
select res.Name as Employee
from (
         select e.Name, e.Salary, e1.Salary as ManagerSalary
         from Employee e
                  left join employee e1 on e.ManagerID = e1.Id) res
where res.Salary > res.ManagerSalary;

A pupil Tim gets homework to identify whether three line segments could possibly form a triangle. <br>
 

However, this assignment is very heavy because there are hundreds of records to calculate.<br>
 

Could you help Tim by writing a query to judge whether these three sides can form a triangle, assuming table triangle holds the length of the three sides x, y and z. <br>
 

| x  | y  | z  |<br>
|----|----|----|<br>
| 13 | 15 | 30 |<br>
| 10 | 20 | 15 |<br><br>
For the sample data above, your query should return the follow result:<br><br>
| x  | y  | z  | triangle |<br>
|----|----|----|----------|<br>
| 13 | 15 | 30 | No       |<br>
| 10 | 20 | 15 | Yes      |<br>

In [ ]:
# Write your MySQL query statement below
select x, y, z, 
case
when x+y > z and
 x+z > y and
 y+z > x then "Yes"
else "No"
end as triangle from triangle;


# Alternate solution
select x, y, z,
IF (x >= y + z OR y >= z + x OR z >= x + y, "No", "Yes") 
AS triangle
FROM triangle

Write a SQL query to delete all duplicate email entries in a table named Person, keeping only unique emails based on its smallest Id. <br><br>

+----+------------------+<br>
| Id | Email            |<br>
+----+------------------+<br>
| 1  | john@example.com |<br>
| 2  | bob@example.com  |<br>
| 3  | john@example.com |<br>
+----+------------------+<br><br>
Id is the primary key column for this table.<br>
For example, after running your query, the above Person table should have the following rows:<br><br>

+----+------------------+<br>
| Id | Email            |<br>
+----+------------------+<br>
| 1  | john@example.com |<br>
| 2  | bob@example.com  |<br>
+----+------------------+<br>

In [ ]:
delete from Person where Id not in
( select res.Id from 
 (select min(Id) as Id from Person
 group by Email) res order by res.Id);

Table: Customers <br><br>

+---------------+---------+<br>
| Column Name   | Type    |<br>
+---------------+---------+<br>
| customer_id   | int     |<br>
| name          | varchar |<br>
| country       | varchar |<br>
+---------------+---------+<br><br>
customer_id is the primary key for this table.<br>
This table contains information of the customers in the company.<br>
 

Table: Product<br><br>

+---------------+---------+<br>
| Column Name   | Type    |<br>
+---------------+---------+<br>
| product_id    | int     |<br>
| description   | varchar |<br>
| price         | int     |<br>
+---------------+---------+<br><br>
product_id is the primary key for this table.<br>
This table contains information of the products in the company.<br>
price is the product cost.<br><br>
 

Table: Orders<br><br>

+---------------+---------+<br>
| Column Name   | Type    |<br>
+---------------+---------+<br>
| order_id      | int     |<br>
| customer_id   | int     |<br>
| product_id    | int     |<br>
| order_date    | date    |<br>
| quantity      | int     |<br>
+---------------+---------+<br><br>
order_id is the primary key for this table.<br>
This table contains information on customer orders.<br>
customer_id is the id of the customer who bought "quantity" products with id "product_id".<br>
Order_date is the date in format ('YYYY-MM-DD') when the order was shipped.<br>
 

Write an SQL query to report the customer_id and customer_name of customers who have spent at least $100 in each month of June and July 2020.<br>

Return the result table in any order.<br>
<br>
The query result format is in the following example.<br>

 

Customers<br><br>
+--------------+-----------+-------------+<br>
| customer_id  | name      | country     |<br>
+--------------+-----------+-------------+<br>
| 1            | Winston   | USA         |<br>
| 2            | Jonathan  | Peru        |<br>
| 3            | Moustafa  | Egypt       |<br>
+--------------+-----------+-------------+<br><br>

Product<br><br>
+--------------+-------------+-------------+<br>
| product_id   | description | price       |<br>
+--------------+-------------+-------------+<br>
| 10           | LC Phone    | 300         |<br>
| 20           | LC T-Shirt  | 10          |<br>
| 30           | LC Book     | 45          |<br>
| 40           | LC Keychain | 2           |<br>
+--------------+-------------+-------------+<br><br>

Orders<br><br>
+--------------+-------------+-------------+-------------+-----------+<br>
| order_id     | customer_id | product_id  | order_date  | quantity  |<br>
+--------------+-------------+-------------+-------------+-----------+<br>
| 1            | 1           | 10          | 2020-06-10  | 1         |<br>
| 2            | 1           | 20          | 2020-07-01  | 1         |<br>
| 3            | 1           | 30          | 2020-07-08  | 2         |<br>
| 4            | 2           | 10          | 2020-06-15  | 2         |<br>
| 5            | 2           | 40          | 2020-07-01  | 10        |<br>
| 6            | 3           | 20          | 2020-06-24  | 2         |<br>
| 7            | 3           | 30          | 2020-06-25  | 2         |<br>
| 9            | 3           | 30          | 2020-05-08  | 3         |<br>
+--------------+-------------+-------------+-------------+-----------+<br><br>

Result table:<br><br>
+--------------+------------+<br>
| customer_id  | name       |  <br>
+--------------+------------+<br>
| 1            | Winston    |<br>
+--------------+------------+ <br><br>
Winston spent $300 (300 * 1) in June and $100 ( 10 * 1 + 45 * 2) in July 2020.<br>
Jonathan spent $600 (300 * 2) in June and $20 ( 2 * 10) in July 2020.<br>
Moustafa spent $110 (10 * 2 + 45 * 2) in June and $0 in July 2020.<br>